In [34]:
import pandas as pd

In [ ]:
pd.Data

In [1]:
import mysql.connector

In [2]:
import json

f=open('students.json','r')
data=json.load(f)

In [6]:
#.connect is a function of mysequal that allows me to connect to aws
#could have also written in this cnx = database = students
cnx = mysql.connector.connect(
    host = "flatiron.cimm2ummmfkj.us-east-1.rds.amazonaws.com",
    user = "avivamaz",
    passwd = "Ghustav1!")
#.cursor is a method of cnx
cursor = cnx.cursor()

In [4]:
#this has an error this time because only need to run it once to create the database
#.execute is a method of cnx
cursor.execute("CREATE DATABASE students")

DatabaseError: 1007 (HY000): Can't create database 'students'; database exists

In [9]:
#.database is an attribute because there are no ()
#cnx.database = 'students' allows us to access the database called students without having to say cnx.students every time
cnx.database = 'students'

In [7]:
create_query = """
CREATE TABLE students
(name VARCHAR(225), dob date, fav_food VARCHAR(200), birthplace VARCHAR(225),years_in_nyc int
);
"""

In [10]:
cursor.execute(create_query)

In [27]:
students_list = []

for student in data:
    if 'birthdate' in student:
        student['dob']=student['birthdate']
        
    student_tuple= (student['name'],
                    student['dob'],
                    student['fav_food'],
                    student['birthplace'],
                    student['years_in_nyc'])
    students_list.append(student_tuple)

In [19]:
stmt = """INSERT INTO students (name, dob, fav_foodVAR, birthplace, years_in_nyc)
        VALUES (%s, %s, %s, %s, %s)"""

In [23]:
fake = (1,2,3,4)

In [20]:
students_list[0]

('Anastasia Gorina', '1991-07-19', 'oysters', 'St. Petersburg, Russia', 5)

In [ ]:
cursor.execute()

In [21]:
cursor.execute(stmt, students_list[0])

In [22]:
#cnx.commite()
cnx.commit()

In [28]:

cursor.executemany(stmt, students_list)
cnx.commit()

In [32]:
cursor.execute('''SELECT * FROM students;''')

In [33]:
dat1 = cursor.fetchall()

In [36]:
pd.DataFrame(dat1, columns = ['name', 'dob'])

,0,1,2,3,4
0,Anastasia Gorina,1991-07-19,oysters,"St. Petersburg, Russia",5
1,Andres M Chaves,1983-01-22,chocolate,"Bogota, CU",6
2,Andrew Triola,1989-10-17,baked ziti,Washington DC,3
3,Anita Guo,1990-12-17,Seafood Boil,"Fuzhou, China",16
4,Askhat Yktybaev,None,cheese cake,"Bishkek, Kyrgyzstan",3
5,Aviva Sally Mazurek,1994-04-29,Burgers,"Bronx, NY",2
6,Ben Johnson-Laird,1900-04-01,Roast Beef and Yorkshire pudding,"London, UK",21
7,Brittany Fowle,1992-05-27,noodles,"Painesville, OH",9
8,Chadwick Balloo,1991-07-29,chicken,"Queens, New York",1
9,Ed Haracz,1995-02-24,pizza,"Glen Ridge, NJ",0
10,Grace Park,1990-04-05,sushi,"Flushing, NY",29
11,Jackson Bull,1987-11-28,fried_chicken,"Nashville, TN",8
12,Julia Chong,1996-11-27,soup dumplings,"Portland, OR",2
13,Owen Peng,1996-05-04,Burgers,"OKC, OK",13
14,Raphael Krantz,1973-03-21,lasagna,New York City,31
15,Rob Zifchak,1989-08-02,Sushi,"Santa Monica, CA",2
16,Robert Alterman,1996-03-16,chicken fingers,"New Rochelle, NY",3
17,Sean Abu Wilson,1985-02-06,strawberry cake,"Birmingham, AL",8

('Anastasia Gorina',
 datetime.date(1991, 7, 19),
 'oysters',
 'St. Petersburg, Russia',
 5)